[
  {
    "file": "content/blog/you-cant-follow-jesus-and-hate-immigrants.md",
    "filename": "you-cant-follow-jesus-and-hate-immigrants.md",
    "title": "You Can't Follow Jesus and Hate Immigrants",
    "tags": [
      "immigration"
    ],
    "categories": [
      "ethics",
      "theology"
    ],
    "content_preview": "## You Can't Follow Jesus and Hate Immigrants\n\nYou can’t follow Jesus and hate immigrants. Of course, this does NOT settle every question of immigration policy! But, if you’re a follower of Jesus, consider your overall posture toward immigrants. If you call yourself a Christian, I want you to think about this seriously.\n\nWhat comes into your head and your heart when you think of immigrants and refugees? Fear? Anger? Disgust?\n\nWhat if the immigrants are in your country legally? What if they’re yo"
  },
  {
    "file": "content/blog/romans-13.md",
    "filename": "romans-13.md",
    "title": "You're Reading Romans 13 Wrong! Here's How to Read It Correctly",
    "tags": [],
    "categories": [
      "ethics",
      "theology"
    ],
    "content_preview": "Without context, words can mean anything and everything, and therefore mean nothing. It is only through the delimiting influence of context that words, phrases, sentences, and paragraphs have any meaning at all.\n\nAlthough this seems simple enough, it is often forgotten when interpreting the Bible. Due to influences as simple as our versification of the biblical text and as complex as the historical/theological developments which have dictated how we teach and interpret the Scriptures, many inter"
  },
  {
    "file": "content/blog/bonhoeffer-timeline-a-brief-chronology-of-dietrich-bonhoeffers-life.md",
    "filename": "bonhoeffer-timeline-a-brief-chronology-of-dietrich-bonhoeffers-life.md",
    "title": "Bonhoeffer Timeline: A Chronology of Dietrich Bonhoeffer’s Life",
    "tags": [
      "bonhoeffer"
    ],
    "categories": "dissertation",
    "content_preview": "## The *Cambridge Companion to Dietrich Bonhoeffer*\n\nSOURCE (Amazon affiliate link): John W. de Gruchy, ed., [*The Cambridge Companion to Dietrich Bonhoeffer*](https://www.amazon.com/Cambridge-Companion-Dietrich-Bonhoeffer-Companions/dp/0521587816/ref=as_li_ss_tl?keywords=cambridge+companion+bonhoeffer&qid=1573571187&sr=8-1&linkCode=ll1&tag=joshuapsteele-20&linkId=9741ea7f11b81c3e60c2df438c4b6202&language=en_US) (Cambridge: Cambridge University Press, 1999), xxiv–xxvi.\n\n- 1906, 4 February, Dietr"
  },
  {
    "file": "content/blog/14-characteristics-of-fascism.md",
    "filename": "14-characteristics-of-fascism.md",
    "title": "14 Characteristics of Fascism: Umberto Eco on Ur-Fascism",
    "tags": [
      "fascism",
      "authoritarianism"
    ],
    "categories": "ethics",
    "content_preview": "Let's try to define (or at least describe) fascism, shall we? \n\n> Fascism: \"a populist political philosophy, movement, or regime (such as that of the Fascisti) that exalts nation and often race above the individual, that is associated with a centralized autocratic government headed by a dictatorial leader, and that is characterized by severe economic and social regimentation and by forcible suppression of opposition\" (Merriam-Webster)\n\nNotoriously difficult to define, [Umberto Eco nevertheless h"
  }
]